cask_args appdir: '/Applications'

tap 'caskroom/fonts'
tap 'coinbase/assume-role'
tap 'elastic/tap'
tap 'homebrew/bundle'
tap 'kong/kong'
tap 'minio/stable'
tap 'mongodb/brew'
tap 'puma/puma'
tap 'weaveworks/tap'

brew 'ack'
brew 'adr-tools'
brew 'awscli'
brew 'bazel'
brew 'coreutils'
brew 'eksctl'
brew 'elixir'
brew 'erlang'
brew 'fswatch'
brew 'fzf'
brew 'ghostscript'
brew 'git-secrets'
brew 'git'
brew 'git'
brew 'gitleaks'
brew 'glib'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'helm'
brew 'heroku'
brew 'htop'
brew 'htop'
brew 'imagemagick'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kube-capacity'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mdcat'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'telepresence'
brew 'telnet'
brew 'terraform-docs'
brew 'tesseract'
brew 'tfenv'
brew 'unrar'
brew 'vegeta'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yq'

cask 'android-studio'
cask 'aws-vault'
cask 'docker'
cask 'fastlane'
cask 'figma'
cask 'firefox'
cask 'framer-x'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'keybase'
cask 'metabase'
cask 'minikube'
cask 'mongodb-compass-community'
cask 'monodraw'
cask 'postico'
cask 'postman'
cask 'quicklook-json'
cask 'robo-3t'
cask 'slack'
cask 'visual-studio-code'
cask 'wireshark'
cask 'zeplin'
cask 'zoomus'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-montserrat'
cask 'font-open-sans'
