cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'ghostscript'
brew 'git-extras'
brew 'go'
brew 'grc'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'tesseract'
brew 'unrar'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'ableton-live-standard'
cask 'android-studio'
cask 'atom'
cask 'docker'
cask 'fastlane'
cask 'framer'
cask 'google-chrome'
cask 'imageoptim'
cask 'postman'
cask 'robomongo'
cask 'sketch'
cask 'slack'
cask 'steam'
cask 'tunnelbear'
cask 'webstorm'
cask 'wireshark'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-montserrat'
cask 'font-open-sans'
